REDIS_ADDR = 'localhost'
REDIS_PORT = 6379

PG_CONNECT_PARAMS = { 'dbname': 'solar_controller_telemetry', 'user': 'postgres', 'password': 'gen_postgress_password', 'host': '127.0.0.1', 'port': '5432' }


DEVICE_ID = 2


MODE_1 = "режим"
MODE_2 = "откл."
MODE_3 = "вкл."

controller_modes_dict = {
    "контроль включения/выключения нагрузки": 0,
    "выкл. через 1 час": 1,
    "выкл. через 2 час": 2,
    "выкл. через 3 час": 3,
    "выкл. через 4 час": 4,
    "выкл. через 5 час": 5,
    "выкл. через 6 час": 6,
    "выкл. через 7 час": 7,
    "выкл. через 8 час": 8,
    "выкл. через 9 час": 9,
    "выкл. через 10 час": 10,
    "выкл. через 11 час": 11,
    "выкл. через 12 час": 12,
    "выкл. через 13 час": 13,
    "выкл. через 14 час": 14,
    "ручной режим": 15,
    "режим отладки": 16,
    "включен": 17
}
